# Дан список чисел. Превратите его в список квадратов этих чисел.
# Результаты вывести на экран.

_list = [1, 3, 5, 7, 9, 11, 13, 15]

for i in _list:
    print(i ** 2)
